rails/webapp/app/controllers/todos_controller.rb

  def create
    params.permit!
    @item = Item.new(params[:item])
    @item.save
---
INSERT INTO `items` (`name`, `created_at`, `updated_at`) VALUES ('aoeuaoeueu', '2015-05-04 00:01:06', '2015-05-04 00:01:06')

  def destroy
    @item_id = params[:id]
    if item = Item.find_by_id(@item_id)
      item.destroy
---
SELECT  `items`.* FROM `items` WHERE `items`.`id` = 6 LIMIT 1
DELETE FROM `items` WHERE `items`.`id` = 6